tap "arl/arl"
tap "homebrew/bundle"
# General-purpose data compression with high compression ratio
brew "xz"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Version manager for neovim
brew "bob"
# Ruby environment tool
brew "chruby"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library for command-line editing
brew "readline"
# Platform built on V8 to build network applications
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Small build system for use with gyp or CMake
brew "ninja"
# Draw UML diagrams
brew "plantuml"
# Utility that provides fast incremental file transfer
brew "rsync"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# UNIX shell (command interpreter)
brew "zsh"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Online diagram software
cask "drawio"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Detailed information on every Apple product ever made
cask "mactracker"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Open-source software for live streaming and screen recording
cask "obs"
# Replacement for Docker Desktop
cask "orbstack"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Virtual machines UI using QEMU
cask "utm"
# Keyboard configurator
cask "via"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
