cheshirekow.cmake-format
eamodio.gitlens
editorconfig.editorconfig
github.github-vscode-theme
github.vscode-github-actions
golang.go
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
hediet.vscode-drawio
james-yu.latex-workshop
jebbs.plantuml
kevinrose.vsc-python-indent
malmaud.tmux
matepek.vscode-catch2-test-adapter
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
redhat.vscode-yaml
rust-lang.rust-analyzer
ryanluker.vscode-coverage-gutters
simonsiefke.svg-preview
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
tamasfe.even-better-toml
tomoki1207.pdf
twxs.cmake
xaver.clang-format
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
