BeardedPlatypus.tox-runner
cheshirekow.cmake-format
DavidAnson.vscode-markdownlint
DavidSchuldenfrei.gtest-adapter
DavidWang.ini-for-vscode
eamodio.gitlens
EditorConfig.EditorConfig
ExecutableBookProject.myst-highlight
fabiospampinato.vscode-diff
gaborv.flatbuffers
GitHub.github-vscode-theme
Gruntfuggly.todo-tree
hbenl.vscode-test-explorer
hediet.vscode-drawio
jebbs.plantuml
kangping.protobuf
KevinRose.vsc-python-indent
lextudio.restructuredtext
luggage66.AWK
malmaud.tmux
matepek.vscode-catch2-test-adapter
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
peterj.proto
PKief.material-icon-theme
plex.vscode-protolint
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
ryanluker.vscode-coverage-gutters
simonsiefke.svg-preview
spmeesseman.vscode-taskexplorer
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
trond-snekvik.simple-rst
twxs.cmake
wayou.vscode-todo-highlight
yzane.markdown-pdf
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
